{"reviews":[{"title":"Productive and fun workplace","text":"A typical day at work includes early morning briefings, tackling previous unfinished duties and making sure the whole project team are in agreement","rating":"4","id":"19qvpk1309r6qcm5","language":"en","reviewer":"Test Analyst (Contract)","location":"london","cons":"","pros":"","url":"https://indeed.com/cmp/Tripadvisor/reviews/productive-and-fun-workplace?id=e09ecf83d69a73ac","datetime":"2015-07-24T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"4","compensation_and_benefits_rating":"4","job_security_and_advancement_rating":"4","management_rating":"4","job_culture_rating":"4"},{"title":"The pros outweigh the cons","text":"In general, I agree with one of the prior reviewers, whose \"Cons\" for TripAdvisor read: \"Unfocused and immature management, a highly enefficient [sic] workplace with minimal room for career advancement.\"\r\n\r\nHowever, I don't agree with everything this person said - there's a lot more to it than that.\r\n\r\nLet's start with the negatives (bear in mind, this is based on my own experiences as well as those of others - but is not necessarily universal):\r\n1- Much of the middle management (including Directors) was promoted from within. This sounds good - why is it bad? Because they are high-performing, type A folks promoted for their individual contributions and tenure, NOT for their managerial skills and potential. This means that a key layer of management is, as the other person put it, \"unfocused and immature.\" This leads to micro-management, squabbles, and general dissatisfaction - as well as inefficient hiring practices. Speaking of...\r\n2- The hiring process is terrible. Communication - which should be good, since there's a dedicated, internal recruiter between the candidate and the hiring manager - is often slow and tough come by, and there can be long lags in the process for no good reason. The recruiters are hit-or-miss - many are fantastic, but the better they are, the more likely they are to be saddled with far more positions than they should have to handle.\r\n3- Part of the hiring issue is that candidates interviewing for individual contributor roles are often interviewing for 2-3 roles at a time - contributor, senior contributor, and even associate (junior) contributor at the same position - without being told. So if someone comes in to interview for a Senior Engineer role, but doesn't have the experience, they could be offered an Engineer position - but they didn't know that was an option until they received the offer. This is \"sand-bagging\" at its worst, and some hiring managers are more guilty of it than others, but the fact that it's allowed at all is unfortunate.\r\n4- Career advancement of direct reports doesn't seem to be at all interesting to the middle management layer. There's a general attitude of \"Show me you want to move up, show me you deserve to move up, then convince me WHY you should move up... and I'll consider it\" among the managers and directors, rather than them acting as allies and advocates and helping their team members advance. This could be because the company doesn't want people moving up the ladder too quickly, but it causes good people to leave the company too early if they're at all ambitious. \r\n\r\nNow for the good (and there's a lot):\r\n1- The people (individual contributors) are fantastic. I've never worked with a more intelligent, enjoyable group that loves to solve problems.\r\n2- The pay is competitive-plus.\r\n3- The benefits are extraordinary. From the fitness/gym/sports reimbursement to the travel benefit to free lunches five days a week in a brand-new, catered facility, it's clear that the company wants to make their employees happy... at least with superficial things.\r\n4- Chance to work on exciting products. \r\n5- Equity in a billion-dollar (revenue) company.\r\n6- (and this is a huge one) Exciting brand with a great reputation among other companies, especially in the Boston area. If you succeed at Trip, other companies know that you can do the work they ask of you, and will come calling. So 2 years of Trip on your resume will get you plenty of interviews for a one-level bump at a number of other firms.\r\n\r\nI enjoy working for TripAdvisor, and recommend it to friends. It's not for everyone, and the cons can be dealbreakers for some people, but it's a good place to work with diverse, friendly coworkers, good pay, and a fun overall experience.","rating":"4","id":"19pl3prvoak57d2k","language":"en","reviewer":"Individual contributor","location":"Massachusetts","cons":"Mediocre middle management, unfortunate hiring process, lack of career opportunities","pros":"Pay, people, benefits, Hq, free lunch, equity, good brand to launch you to next position","url":"https://indeed.com/cmp/Tripadvisor/reviews/the-pros-outweigh-the-cons?id=55f34f982fb0142b","datetime":"2015-07-07T00:00:00","reviewer_employee_type":"Current Employee","job_work_and_life_balance_rating":"5","compensation_and_benefits_rating":"5","job_security_and_advancement_rating":"2","management_rating":"3","job_culture_rating":"4"},{"title":"This is an unpaid position, it's voluntary","text":"I love writing and photographing the reviews I deliver.  I have focused on Hotel's, restaurants, and things to do.  TripAdvisor is based on individuals who write about their experience that forms a consortium for a particular place.  Being a chef myself, and customer focused, I always will meet the manager, and get a brief story of what I am writing about to personalize it.  This is a passion of mine and am a Top Contributor of TripAdvisor with many badges and followers who read my reviews. I would love to incorporate my experience in the food, hospitality and travel that I have years of experience doing.","rating":"5","id":"19phk6oedak579do","language":"en","reviewer":"Independent Hospitality and Restaurant Reviewer","location":"Needham, MA","cons":"You have to pay the bills!","pros":"When you truly find your passion and what your good at, money is not all that important","url":"https://indeed.com/cmp/Tripadvisor/reviews/this-is-an-unpaid-position-it-s-voluntary?id=e90171a654a9d930","datetime":"2015-07-06T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"5","compensation_and_benefits_rating":"4","job_security_and_advancement_rating":"3","management_rating":"4","job_culture_rating":"4"},{"title":"Exciting workplace","text":"I have been working for TripAdvisor for almost three years now and I love the job culture and coming here every day due to the relationship I have with my colleagues and managers. It's a very relaxed place where they provide us with lunch sometimes, and events such as karaoke/pizza's night and drinks in the terrace. I grew so much in this Company, as I started as Customer Support and then they gave me the opportunity to move to the current position in Fraud Support.","rating":"5","id":"19lmfri12akabcs9","language":"en","reviewer":"Fraud Support Specialist Italian and Spanish","location":"London","cons":"","pros":"","url":"https://indeed.com/cmp/Tripadvisor/reviews/exciting-workplace?id=8d5b55ca56fca5f9","datetime":"2015-05-19T00:00:00","reviewer_employee_type":"Current Employee","job_work_and_life_balance_rating":"5","compensation_and_benefits_rating":"4","job_security_and_advancement_rating":"3","management_rating":"5","job_culture_rating":"5"},{"title":"A busy but uneventful and counterproductive workplace","text":"On the good side, people are quite diverse and interesting, but management is extraordinarily immature and unfocused, with their products reflecting this mood: this is the mega-mammoth of travel services, and it just about sums it up - big, grotesquely uncultured and massively inefficient.\r\n\r\nImagine having 10+ years of experience but reporting directly to someone who has half that... and has never shipped a new product before he/she joined the firm. Your days feel empty, scrambled and uneventful, and you are being micromanaged (that's what people do when they perceive you as a threat or when your product management role is downplayed to the level of a technical project manager, whereas your contribution to the product's roadmap is limited to writing technical documentation). Chances of career advancement? Zero to none.\r\n\r\nShame on me - I should have known better: when you have shipped roughly 5 times more marketable products than your hiring manager, your career is going nowhere... and sadly, no one cares that the department is managed poorly.\r\n\r\nIronically, if you do get hired into an environment like this and are good at what you do, you *will* be perceived as a threat unless you are good at playing dumb. Combine this with the fact that many of their developers are overseas and you will have to collaborate by getting on the phone at 4am or 9pm a couple of times every week, and this will not sit well with you unless you are a workaholic willing to work for a 10+ year old company that iterates products like there is no tomorrow but offers you zero equity in return for your hard work.  \r\n\r\nThat said, I am quite unexcited about working for TripAdvisor or for any of its subsidiaries (e.g., Viator) again in the future, even if my pay is much higher.","rating":"2","id":"199ifthj5b84g887","language":"en","reviewer":"Product Manager","location":"San Francisco","cons":"Unfocused and immature management, a highly enefficient workplace with minimal room for career advancement","pros":"Diverse culture","url":"https://indeed.com/cmp/Tripadvisor/reviews/a-busy-but-uneventful-and-counterproductive-workplace?id=57adfbafa98d84f7","datetime":"2014-12-19T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"1","compensation_and_benefits_rating":"3","job_security_and_advancement_rating":"1","management_rating":"1","job_culture_rating":"3"},{"title":"Exciting culture in the suburbs","text":"Exciting opportunities working at a fun, lively HQ with \"speed wins\" mentality","rating":"5","id":"1977vn4ib5ncgbji","language":"en","reviewer":"Talent Acquisition","location":"Newton, MA","cons":"","pros":"","url":"https://indeed.com/cmp/Tripadvisor/reviews/exciting-culture-in-the-suburbs?id=e7dec3e7e4deb79c","datetime":"2014-11-20T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"5","compensation_and_benefits_rating":"5","job_security_and_advancement_rating":"5","management_rating":"5","job_culture_rating":"5"},{"title":"Excellent place to work","text":"Sell marketing solutions at the world’s largest travel website  \r\nManage Accounts \r\nB2B sales \r\nRepresent TripAdvisor at international travel fairs (ITB Berlin; Moscow; etc.)\r\nReach targets and KPI standards on monthly basis\r\nWorking with customer database cloud service (Salesforce)\r\nPromotion after one year","rating":"5","id":"18rbts66o9r4g82r","language":"en","reviewer":"Sales Executive","location":"Oxford, ENG","cons":"","pros":"","url":"https://indeed.com/cmp/Tripadvisor/reviews/excellent-place-to-work?id=8da78db3b0b34480","datetime":"2014-06-26T00:00:00","reviewer_employee_type":"Current Employee","job_work_and_life_balance_rating":"5","compensation_and_benefits_rating":"4","job_security_and_advancement_rating":"5","management_rating":"5","job_culture_rating":"5"},{"title":"a very aggressive workplace","text":"If you are into the culture of fast paced for the sake of fast-paced, then this is the place for you, and if you are an engineer you are in a good place, but unfortunately, the positives of this company do not extend to the administrative positions, where the Human Resources department is hostile, ineffective and joyless, and that extends outward. Benefits and compensation were great, but not worth the bad feeling you leave each day with.","rating":"2","id":"18rauv4215ncgcbv","language":"en","reviewer":"Payroll Specialist","location":"Newton, MA","cons":"Hr, culture, upper management","pros":"free lunches, benefits, cash-rich company","url":"https://indeed.com/cmp/Tripadvisor/reviews/a-very-aggressive-workplace?id=dd4cec6857bb468e","datetime":"2014-06-25T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"3","compensation_and_benefits_rating":"4","job_security_and_advancement_rating":"2","management_rating":"1","job_culture_rating":"1"},{"title":"Outstanding company","text":"Superbly structured and very well organized company. Highly skilled Customer Support Team and amazing team spirit. The hardest part of the job is to provide a response to enquiries within the shortest time possible. Best management I've had the pleasure of working with.","rating":"5","id":"18r217l9k9r4ge07","language":"en","reviewer":"Owner Support Specialist (EMEA)","location":"Oxford, ENG","cons":"Very stressfull job","pros":"Great working environment","url":"https://indeed.com/cmp/Tripadvisor/reviews/outstanding-company?id=be9cb50c5a331cfd","datetime":"2014-06-22T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"4","compensation_and_benefits_rating":"4","job_security_and_advancement_rating":"5","management_rating":"5","job_culture_rating":"5"},{"title":"Productive and fun work place","text":"Great new office right near the garden. Great learning opportunity.","rating":"4","id":"18o87kjgk5ncgcl4","language":"en","reviewer":"Marketing Associate","location":"Boston, MA","cons":"","pros":"Great Benefits","url":"https://indeed.com/cmp/Tripadvisor/reviews/productive-and-fun-work-place?id=243e9ddc8be880d3","datetime":"2014-05-18T00:00:00","reviewer_employee_type":"Current Employee","job_work_and_life_balance_rating":"5","compensation_and_benefits_rating":"5","job_security_and_advancement_rating":"3","management_rating":"4","job_culture_rating":"4"},{"title":"Could be great","text":"Could be the greatest work environment but lacks management and especially management that listen and take responsibility.\r\n\r\nWork life balance is great, benefits are great, however this is not the place to come to if you want to progress in your career.","rating":"3","id":"18i3vb4f5708geej","language":"en","reviewer":"Sales Manager","location":"Singapore, S00","cons":"","pros":"","url":"https://indeed.com/cmp/Tripadvisor/reviews/could-be-great?id=da6ec7e7aa5c4b02","datetime":"2014-03-03T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"4","compensation_and_benefits_rating":"4","job_security_and_advancement_rating":"2","management_rating":"1","job_culture_rating":"2"},{"title":"Great Company work for!","text":"Company provides great salary, fun work environment along with health benefits. They focus on keeping you happy by catering lunch 2-3x week snacks, coffee etc. Amazing place to be part of .","rating":"5","id":"176o8d8i15dog80p","language":"en","reviewer":"Inside Sales Representative","location":"Newton, MA","cons":"hard to hear back from hr","pros":"free lunch + snacks","url":"https://indeed.com/cmp/Tripadvisor/reviews/great-company-work-for?id=872a7081cba3643a","datetime":"2012-09-10T00:00:00","reviewer_employee_type":"Former Employee","job_work_and_life_balance_rating":"5","compensation_and_benefits_rating":"5","job_security_and_advancement_rating":"4","management_rating":"4","job_culture_rating":"5"}],"totals":{"review_count":133,"average_rating":"3.9","job_work_and_life_balance_rating":"3.9","compensation_and_benefits_rating":"3.9","job_security_and_advancement_rating":"3.3","management_rating":"3.4","job_culture_rating":"3.9"}}